---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CoverOffsetTooLong
source: html/69a9ed44-2493-176d-b9b3-cd0381b6a1f2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CoverOffsetTooLong Property

Cover offset is greater than host thickness.

## Syntax (C#)
```csharp
public static FailureDefinitionId CoverOffsetTooLong { get; }
```